In [30]:
import pandas as pd
import sqlite3

In [31]:
df = pd.read_json('MOCK_DATA.json')

In [36]:
df.head()

,id,first_name,last_name,email,gender,date_of_birth,industry,salary,years_of_experience
0,1,Annmarie,Crooke,acrooke0@gizmodo.com,None,09/07/1978,Other Specialty Stores,180466.37,10.0
1,2,Morrie,Lahive,mlahive1@imdb.com,None,20/04/1948,Diversified Financial Services,239640.00,6.0
2,3,Matthias,Roden,mroden2@abc.net.au,M,30/11/1998,Metal Fabrications,139679.79,31.0
3,4,Madelin,Domke,mdomke3@mozilla.com,None,05/05/1979,n/a,196786.25,12.0
4,5,Thain,Souter,tsouter4@cisco.com,M,03/08/2002,n/a,140291.87,28.0

In [38]:
df[df['salary'].isnull()]

Empty DataFrame
Columns: [id, first_name, last_name, email, gender, date_of_birth, industry, salary, years_of_experience]
Index: []

In [33]:
df.dtypes

id                       int64
first_name              object
last_name               object
email                   object
gender                  object
date_of_birth           object
industry                object
salary                 float64
years_of_experience    float64
dtype: object

In [34]:
df_nulls = df.isnull().sum()
df_nulls

id                        0
first_name                0
last_name                 0
email                   476
gender                 1021
date_of_birth             0
industry                229
salary                   71
years_of_experience      71
dtype: int64

In [35]:
cols = ['first_name', 'last_name', 'email', 'industry']
for col in cols:
    print(col, df[col].str.len().max())

first_name 13
last_name 20
email 36.0
industry 62.0

#### Pushing data into sqlite3

In [22]:
df['date_of_birth'] = pd.to_datetime(df['date_of_birth'], dayfirst=True)
df['date_of_birth'] = df['date_of_birth'].apply(lambda x : x.strftime('%Y-%m-%d'))

In [23]:
conn = sqlite3.connect('db.sqlite3')
df.to_sql('person', conn, if_exists='append', index=False)

3000